mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1a1xc/s6e1a1xc.svd
        <!-- REGISTER "IRQ28MON" -->
        <register>
          <name>IRQ28MON</name>
          <description>IRQ28 Batch Read Register [BHW]</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FRT2INT" -->
            <field>
              <name>FRT2INT</name>
              <description>Zero/Peak detection interrupt request of the free run timers in the MFT unit 2</description>
              <msb>17</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT1INT" -->
            <field>
              <name>FRT1INT</name>
              <description>Zero/Peak detection interrupt request of the free run timers in the MFT unit 1</description>
              <msb>11</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT0INT" -->
            <field>
              <name>FRT0INT</name>
              <description>Zero/Peak detection interrupt request of the free run timers in the MFT unit 0</description>
              <msb>5</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ29MON" -->
        <register>
          <name>IRQ29MON</name>
          <description>IRQ29 Batch Read Register [BHW]</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ICU2INT" -->
            <field>
              <name>ICU2INT</name>
              <description>Interrupt request of the input capture in the MFT unit 2</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICU1INT" -->
            <field>
              <name>ICU1INT</name>
              <description>Interrupt request of the input capture in the MFT unit 1</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICU0INT" -->
            <field>
              <name>ICU0INT</name>
              <description>Interrupt request of the input capture in the MFT unit 0</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ30MON" -->
        <register>
          <name>IRQ30MON</name>
          <description>IRQ30 Batch Read Register [BHW]</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "OCU2INT" -->
            <field>
              <name>OCU2INT</name>
              <description>Interrupt request of the output compare in the MFT unit 2</description>
              <msb>17</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU1INT" -->
            <field>
              <name>OCU1INT</name>
              <description>Interrupt request of the output compare in the MFT unit 1</description>
              <msb>11</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU0INT" -->
            <field>
              <name>OCU0INT</name>
              <description>Interrupt request of the output compare in the MFT unit 0</description>
              <msb>5</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ31MON" -->
        <register>
          <name>IRQ31MON</name>
          <description>IRQ31 Batch Read Register [BHW]</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FLASHINT" -->
            <field>
              <name>FLASHINT</name>
              <description>RDY/HANG interrupt request for f lash memory</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT15" -->
            <field>
              <name>BTINT15</name>
              <description>IRQ1 interrupt request of the base timer ch.7</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT14" -->
            <field>
              <name>BTINT14</name>
              <description>IRQ0 interrupt request of the base timer ch.7</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT13" -->
            <field>
              <name>BTINT13</name>
              <description>IRQ1 interrupt request of the base timer ch.6</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT12" -->
            <field>
              <name>BTINT12</name>
              <description>IRQ0 interrupt request of the base timer ch.6</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT11" -->
            <field>
              <name>BTINT11</name>
              <description>IRQ1 interrupt request of the base timer ch.5</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT10" -->
            <field>
              <name>BTINT10</name>
              <description>IRQ0 interrupt request of the base timer ch.5</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT9" -->
            <field>
              <name>BTINT9</name>
              <description>IRQ1 interrupt request of the base timer ch.4</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT8" -->
            <field>
              <name>BTINT8</name>
              <description>IRQ0 interrupt request of the base timer ch.4</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT7" -->
            <field>
              <name>BTINT7</name>
              <description>IRQ1 interrupt request of the base timer ch.3</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT6" -->
            <field>
              <name>BTINT6</name>
              <description>IRQ0 interrupt request of the base timer ch.3</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT5" -->
            <field>
              <name>BTINT5</name>
              <description>IRQ1 interrupt request of the base timer ch.2</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT4" -->
            <field>
              <name>BTINT4</name>
              <description>IRQ0 interrupt request of the base timer ch.2</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT3" -->
            <field>
              <name>BTINT3</name>
              <description>IRQ1 interrupt request of the base timer ch.1</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT2" -->
            <field>
              <name>BTINT2</name>
              <description>IRQ0 interrupt request of the base timer ch.1</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT1" -->
            <field>
              <name>BTINT1</name>
              <description>IRQ1 interrupt request of the base timer ch.0</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT0" -->
            <field>
              <name>BTINT0</name>
              <description>IRQ0 interrupt request of the base timer ch.0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCINTSEL0" -->
        <register>
          <name>RCINTSEL0</name>
          <description>Interrupt Factor Selection Register 0 [BHW]</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INTSEL3" -->
            <field>
              <name>INTSEL3</name>
              <description>Select the interrupt factor for the interrupt vector No.22</description>
              <msb>31</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSEL2" -->
            <field>
              <name>INTSEL2</name>
              <description>Select the interrupt factor for the interrupt vector No.21</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSEL1" -->
            <field>
              <name>INTSEL1</name>
              <description>Select the interrupt factor for the interrupt vector No.20</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSEL0" -->
            <field>
              <name>INTSEL0</name>
              <description>Select the interrupt factor for the interrupt vector No.19</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCINTSEL1" -->
        <register>
          <name>RCINTSEL1</name>
          <description>Interrupt Factor Selection Register 1 [BHW]</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INTSEL7" -->
            <field>
              <name>INTSEL7</name>
              <description>Select the interrupt factor for the interrupt vector No.26</description>
              <msb>31</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSEL6" -->
            <field>
              <name>INTSEL6</name>
              <description>Select the interrupt factor for the interrupt vector No.25</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSEL5" -->
            <field>
              <name>INTSEL5</name>
              <description>Select the interrupt factor for the interrupt vector No.24</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSEL4" -->
            <field>
              <name>INTSEL4</name>
              <description>Select the interrupt factor for the interrupt vector No.23</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
