mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1a1xc/s6e1a1xc.svd
        <!-- REGISTER "FPOER6" -->
        <register>
          <name>FPOER6</name>
          <description>Fast GPIO Output Enable Register 6 [BHW]</description>
          <addressOffset>0x918</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of FPOER6</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of FPOER6</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FPOER7" -->
        <register>
          <name>FPOER7</name>
          <description>Fast GPIO Output Enable Register 7 [BHW]</description>
          <addressOffset>0x91C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "FPOER8" -->
        <register>
          <name>FPOER8</name>
          <description>Fast GPIO Output Enable Register 8 [BHW]</description>
          <addressOffset>0x920</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of FPOER8</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of FPOER8</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of FPOER8</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FPOER9" -->
        <register>
          <name>FPOER9</name>
          <description>Fast GPIO Output Enable Register 9 [BHW]</description>
          <addressOffset>0x924</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "FPOERA" -->
        <register>
          <name>FPOERA</name>
          <description>Fast GPIO Output Enable Register A [BHW]</description>
          <addressOffset>0x928</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "FPOERB" -->
        <register>
          <name>FPOERB</name>
          <description>Fast GPIO Output Enable Register B [BHW]</description>
          <addressOffset>0x92C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "FPOERC" -->
        <register>
          <name>FPOERC</name>
          <description>Fast GPIO Output Enable Register C [BHW]</description>
          <addressOffset>0x930</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "FPOERD" -->
        <register>
          <name>FPOERD</name>
          <description>Fast GPIO Output Enable Register D [BHW]</description>
          <addressOffset>0x934</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "FPOERE" -->
        <register>
          <name>FPOERE</name>
          <description>Fast GPIO Output Enable Register E [BHW]</description>
          <addressOffset>0x938</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000D</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of FPOERE</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of FPOERE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of FPOERE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FPOERF" -->
        <register>
          <name>FPOERF</name>
          <description>Fast GPIO Output Enable Register F [BHW]</description>
          <addressOffset>0x93C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
